{
  "cart": [
    {
      "id": 1,
      "quantity": 3
    },
    {
      "id": 2,
      "quantity": 2
    },
    {
      "id": 3,
      "quantity": 2
    },
    {
      "id": 2,
      "quantity": 1
    }
  ],
  "items": [
    {
      "id": 1,
      "title": "История Руни про первый раз в доме",
      "color": "red",
      "price": 10,
      "imageSrc": "https://st4.depositphotos.com/12985790/i/600/depositphotos_228216284-stock-photo-adorable-welsh-corgi-pembroke-puppy.jpg",
      "brief": "Рассказ щенка о том, как он обрел новый дом.",
      "description": [
        {
          "type": "text",
          "text": "Руни появился в новом доме 28 ноября 2021 года. Он был долгожданным подарком своего питомца (отсылка к 101 долматинцу). На дне рождении было очень много людей, но Руни не растерялся и вел себя со всеми дружелюбно, ни разу не гавкнул и даже не сходил в туалет не в положеном месте!"
        },
        {
          "type": "checkbox",
          "name": "check2",
          "variant": [
            "Наклейки с Руни"
          ]
        }
      ]
    },
    {
      "id": 2,
      "title": "Руни первый раз на улице",
      "color": "blue",
      "price": 25,
      "imageSrc": "https://zooclub.ru/attach/1047.jpg",
      "brief": "История о том, как Руни первый раз пошел гулять на улицу со своими питомцами",
      "description": [
        {
          "type": "text",
          "text": "Руни очень волновался, когда ему надо было первый раз выйти на улицу, потому что у него не было поводка и ошейника. Его питомцу пришлось нести его на руках, чтобы он не потрелся и не убежал. Зато когда была куплена удобная шлейка, красивый повод - как приятно было вышагивать рядом со своим питомцем! Можно было обнюхать все углы по пути домой, попрбовать украсть что-то с мусорки (хотя эта шалость почти не удалась...)."
        },
        {
          "type": "image",
          "imageSrc": "https://img.joomcdn.net/d93ee292ec72bb36a220db204f839c5c94d4dea4_original.jpeg"
        },
        {
          "type": "checkbox",
          "name": "check2",
          "variant": [
            "Наклейки с Руни"
          ]
        }
      ]
    },
    {
      "id": 3,
      "title": "Новые друзья",
      "color": "black",
      "price": 40,
      "imageSrc": "https://cdn.spbdnevnik.ru/uploads/block/image/505315/__medium_корги%20пати%20парк%20300%20лет_с.%20холявчук37.JPG.jpg",
      "brief": "Как дойти до Таврического парка в -18 в хорошем настроении, а еще найти новых друзей??? Знает только Руни!",
      "description": [
        {
          "type": "text",
          "text": "Руни всегда ходил гулять в парк рядом с домом, но тут он вышел, подумал: хм, сегодня прохладнее, чем было. Потом он понял, что что-то не так, когда питомцы повели его в другую сторону от его любимого парка - новые запахи, новые собаки, новые мусорки... Глаза разбегаются!!! Но когда он увидел новый огромный парк, у него пересохло горло, хотелось громко гавкать, да гавкать он не привык и не хотелось пугать питомцев, а то вдруг поведут опять в то ужасное место, где другие питомцы ходят в странных белых шторах... Прошло 30 минут, Руни точно убедидся, что ему все нравится, как вдруг он увидел красивого той-терьера, который оказался девочкой, да еще и такой игривой, тут его эмоции достигли пика и он побежал радостно размахивая хвостиком к новому другу с которым играл еще добрых 40 минут.. Отличный день!"
        },
        {
          "type": "checkbox",
          "name": "check1",
          "variant": [
            "Наклейки с Руни"
          ]
        },
        {
          "type": "image",
          "imageSrc": "https://img.joomcdn.net/d93ee292ec72bb36a220db204f839c5c94d4dea4_original.jpeg"
        }
      ]
    }
  ],
  "comments": [
    {
      "shopItemId": 2,
      "text": "Боже, обожаю истории про Руни!!!",
      "id": 1
    },
    {
      "shopItemId": 2,
      "text": "Хочу больше историй!!!",
      "id": 2
    },
    {
      "shopItemId": 2,
      "text": "Руни лучший пес на свете!",
      "id": 3
    }
  ]
}